[
  {
    "q": "What is a calibration list and why is it important?",
    "a": "Our filtering process begins with a calibration list of 10 sample candidate profiles (these candidates are passive and non-committed). You receive this list to help us align our search by a simple thumbs up or thumbs down for each candidate."
  },
  {
    "q": "How do you find candidates?",
    "a": "Our community of freelance recruiter’s crowd source passive talent based on your specific requirements. These freelance recruiters are specialized in their domains and have access to various sourcing & recruitment tools to allow for an extensive search. This method leaves no stone unturned within a short time span to ensure your hire process is seamless, fast and effective."
  },
  {
    "q": "How do you filter candidates?",
    "a": "After the calibration list is validated we open up sourcing to our community of freelance recruiters. You will have 10 – 20 recruiters focused on crowdsourcing for your job. Our Industry experts then validate these passive candidates. After the experts have validated the candidates, we then reach out to them and curate a specialized list of active, qualified and ready to interview candidates fro you! You will begin to receive your first few candidates within 48 hours."
  },
  {
    "q": "Who are the recruiters?",
    "a": "Our freelance recruiters are specialized in specific industry domains from all over the globe. They range from specialties in sales and business development to web designers and software engineers. We have industry specific experts that are specialized in industries from tech and e-commerce to renewables and solar. Our freelance recruiters and experts have you covered!"
  },
  {
    "q": "When will I receive the first candidates?",
    "a": "You will receive your calibration list within 1 – 2 working days of providing us with your approved requirements.Your first batch of active, qualified and ready to interview candidates will be ready within 2 working days of the calibration lists validation."
  },
  {
    "q": "How do I get in contact with the candidates?",
    "a": "After the candidate has confirmed their interest in your role and has been submitted to the shortlist for your review, you are able to reach out to any desired candidate for an interview by selecting the ‘Request Interview’ button on your dashboard. You will instantly be connected to the candidate via email."
  }
]