[
  {
    "q": "Can anyone be a recruiter for Visage?",
    "a": "Yes. We would prefer that you have a background in recruitment, especially if you have worked as a freelance recruiter. If you do not have a background in recruitment, but are able to refer quality candidates that are relevant to the requirements, you can still be successful with us."
  },
  {
    "q": "What do I get paid for? ",
    "a": "You get paid for every 'Approved' candidate profile that you submit to us for a job requirement. Candidate profiles are validated by our Experts against the role requirements and are either 'Approved' or 'Disqualified'."
  },
  {
    "q": "How do I get paid?",
    "a": "We use a secure payment platform called Payoneer. When you sign up to be a Recruiter with us, you will be directed to setup your account.."
  },
  {
    "q": "When do I get paid?",
    "a": "You are paid on a weekly basis for every 'Approved' candidate profile you submitted per Monday-Sunday pay period."
  },
  {
    "q": "Do you provide any recruitment tools? ",
    "a": "We don't provide you with any Job Board or media-based recruitment tools. Since all of our Recruiters are freelance professionals, you will need to have your own network and database of candidates, such as LinkedIn, Google Search or job boards."
  },
  {
    "q": "When and where can I work for Visage?",
    "a": "Anytime and anywhere! We have no restrictions on when or where you work. Whether you commit full time, part time, evenings or weekend, at home or in a coffee shop the choice is yours. We do recommend however that you do not breach any contractual relations you have with a current employer."
  },
  {
    "q": "How do I know the status of my submitted candidates?",
    "a": "All of your referred candidates will be stamped with your Recruiter i.d. and will be validated with a 'Thumbs Up' (Approved) or 'Thumbs Down' (Disqualified with appropriate notes recorded on the candidate record). You can view the status of each candidate on your own personal dashboard."
  },
  {
    "q": "How many candidate profiles can I submit to the same role?",
    "a": "You can submit up to 100 candidate profiles at a time. Once you have submitted the maximum number of candidate profiles, you will have to wait to submit more until the Expert has validated the current batch."
  },
  {
    "q": "What happens if another recruiter refers the same candidate?",
    "a": "W prefer that you provide up to 20 good quality CV's per role, more if you have them and they are outstanding. The better the candidates, the more you will be able to submit for the next positions."
  },
  {
    "q": "What happens if another recruiter refers the same candidate?",
    "a": "Candidates are accepted on a first come first serve basis with each candidate record being date and time stamped. If two or more Recruiters submit the same candidate, only the first one submitted will be considered."
  }
]